---
title: Самостоятельная работа № 7
subtitle: Базы данных
---
\clearpage

# Типы данных СУБД PostgreSQL.

## Ответы

1. Создали и заполнили таблицу

```sql
demo> create table test_numeric
 ( measurement numeric(5, 2),
   description text );
```
```
CREATE TABLE
```
```sql
demo> select * from test_numeric;
```
```
+-------------+--------------------+
| measurement | description        |
|-------------+--------------------|
| 999.90      | Еще одно измерение |
| 999.11      | И еще измерение    |
| 999.00      | И еще одно         |
+-------------+--------------------+
```

Команда вставки вида

```sql
INSERT INTO test_numeric
 VALUES ( 999.9999, 'Какое-то измерение' );
```

не сработает, потому что при округлении получается число `1000.00`, а его точность (общее количество цифр) равно 6, что больше заданного `5`.

2. Если создать поле `numeric` без ограничений на размер, то все числа будут сохранятся так, как и были введены

```sql
demo> create table test_numeric
 ( measurement numeric,
   description text );
```
```
CREATE TABLE
```
```sql
select * from test_numeric;
```
```
+------------------------+---------------------+
| measurement            | description         |
|------------------------+---------------------|
| 1234567890.0987654321  | 20, 10              |
| 1.5                    | 2, 1                |
| 0.12345678901234567890 | 21, 20              |
| 1234567890             | 10, 0 (целое число) |
+------------------------+---------------------+
SELECT 4
```

3. Работа с `NaN`.

- `NaN == NaN`

```sql
demo> select 'NaN'::numeric = 'NaN'::numeric;
```
```
+----------+
| ?column? |
|----------|
| True     |
+----------+
```

- `NaN` больше любого не `NaN`

```sql
demo> SELECT 'NaN'::numeric > 10000;
```
```
+----------+
| ?column? |
|----------|
| True     |
+----------+
SELECT 1
```

4. Очень маленькие числа не получается сравнивать, потому что они находятся на границе допустимого диапазона

```sql
SELECT '5e-324'::double precision > '4e-324'::double precision;
```
```
+----------+
| ?column? |
|----------|
| False    |
+----------+
SELECT 1
```

5. Значения `Infinity` и `-Infinity`.

```sql
demo> SELECT '-Inf'::double precision < -1E+308;
```
```
+----------+
| ?column? |
|----------|
| True     |
+----------+
SELECT 1
```

6. `Not a Number`

Если математический результат не определён

```sql
demo> SELECT 0.0 * 'Inf'::real;
```
```
+----------+
| ?column? |
|----------|
| nan      |
+----------+
SELECT 1
```

`NaN` больше любого числа, включая `Infinity` и `-Infinity`

```sql
demo> SELECT 'NaN'::real > 'Inf'::real;
```
```
+----------+
| ?column? |
|----------|
| True     |
+----------+
SELECT 1
```

7. `serial` - генератор чисел. Используется как `id`

```sql
demo> create table test_serial
 ( id serial,
   name text );
```

Если создать запись с заданием `id` вручную, то может получиться такая ситуация

```sql
demo> select * from test_serial;
```
```
+----+------------+
| id | name       |
|----+------------|
| 1  | test       |
| 2  | Вишневая   |
| 10 | Прохладная |
| 3  | Луговая    |
| 4  | Луговая    |
| 5  | Луговая    |
| 6  | Луговая    |
| 7  | Луговая    |
| 8  | Луговая    |
| 9  | Луговая    |
| 10 | Луговая    |
| 11 | Луговая    |
| 12 | Луговая    |
+----+------------+
```

```sql
demo> select * from test_serial where id = '10';
```
```
+----+------------+
| id | name       |
|----+------------|
| 10 | Прохладная |
| 10 | Луговая    |
+----+------------+
```

8. Если сделать таблицу так

```sql
demo> CREATE TABLE test_serial
 ( id serial PRIMARY KEY,
   name text
 );
```

И ввести значения

```sql
INSERT INTO test_serial ( name ) VALUES ( 'Вишневая' );
INSERT INTO test_serial ( id, name ) VALUES ( 2, 'Прохладная' );
```

То при вводе следующей команды два раза

```sql
INSERT INTO test_serial ( name ) VALUES ( 'Грушевая' );
```

первый раз будет ошибка про дупликацию ключа, а второй раз уже нет, потому что после вставки предыдущих элеметов `serial` выдавал значение `2`, но оно уже было в таблице.

Также могут образовываться "дыры" в таблице

```sql
demo> delete from test_serial where id = '2';
```
```
DELETE 1
```
```sql
demo> select * from test_serial;
```
```
+----+----------+
| id | name     |
|----+----------|
| 1  | Вишневая |
| 3  | Грушевая |
+----+----------+
SELECT 2
```

9. В PostgreSQL используется григорианский календарь для дат.

10. Ограничения на `timestamp`

Минимальное значение - 4713 до н. э., максимальное - 294276 н. э.
